performance-testing/results/dashboard-report/statistics.json
{
  "POST - Create Note Load Target" : {
    "transaction" : "POST - Create Note Load Target",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 804.4999999999999,
    "medianResTime" : 536.5,
    "minResTime" : 345.0,
    "maxResTime" : 7438.0,
    "pct1ResTime" : 1501.7,
    "pct2ResTime" : 1621.4999999999995,
    "pct3ResTime" : 7408.31,
    "throughput" : 10.254727429344928,
    "receivedKBytesPerSec" : 12.87040395935026,
    "sentKBytesPerSec" : 1.8526607172156364
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 858.3233333333334,
    "medianResTime" : 556.0,
    "minResTime" : 345.0,
    "maxResTime" : 7540.0,
    "pct1ResTime" : 1546.5000000000002,
    "pct2ResTime" : 2000.2999999999993,
    "pct3ResTime" : 7417.81,
    "throughput" : 11.148272017837236,
    "receivedKBytesPerSec" : 13.958456719156448,
    "sentKBytesPerSec" : 1.9850601542177628
  },
  "POST - Token Generation" : {
    "transaction" : "POST - Token Generation",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1127.4399999999998,
    "medianResTime" : 732.5,
    "minResTime" : 363.0,
    "maxResTime" : 7540.0,
    "pct1ResTime" : 1996.6,
    "pct2ResTime" : 3552.1,
    "pct3ResTime" : 7540.0,
    "throughput" : 3.922183871979918,
    "receivedKBytesPerSec" : 4.852093833346408,
    "sentKBytesPerSec" : 0.6473135491841858
  }
}